"""
Реализовать алгоритм поиска выигрышных и проигрышных позиций в аналогичной игре,
но ходы делает король (только вправо, вниз и по диагонали).
"""

N = 5
M = 5
K = [[1]*(M+1) for i in range(N+1)]

for i in range(N-1, -1, -1):
    for j in range(M-1, -1, -1):
        if i == (N-1) and j == (M-1):
            K[i][j] = 0
        elif K[i+1][j] == 1 and K[i][j+1] == 1 and K[i+1][j+1] == 1:
            K[i][j] = 0
for i in range(N):
    print(K[i][0:M])
